           IDENTIFICATION DIVISION.
           PROGRAM-ID. STATS.
        
           ENVIRONMENT DIVISION.
           INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "NUMS.TXT"
                  ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO "NOUT.TXT"
                  ORGANIZATION IS LINE SEQUENTIAL.
         
           DATA DIVISION.
           FILE SECTION.
           FD INPUT-FILE.
           01 SAMPLE-INPUT     PIC X(80).
           FD OUTPUT-FILE.
           01 OUTPUT-LINE      PIC X(80).
    
           WORKING-STORAGE SECTION.
           77 SX   PICTURE S9(14)V9(4) USAGE IS COMPUTATIONAL-3.
           77 N    PICTURE S9999 USAGE IS COMPUTATIONAL.
           77 M    PICTURE S9(14)V9(4) USAGE IS COMPUTATIONAL-3.
           77 I    PICTURE S9999 USAGE IS COMPUTATIONAL.
           77 STD  PICTURE S9(14)V9(4) USAGE IS COMPUTATIONAL-3.
           77 TEMP PICTURE S9(14)V9(4) USAGE IS COMPUTATIONAL-3.
           01 ARRAY-AREA.
              02 X PICTURE S9(14)V9(4) USAGE IS COMPUTATIONAL-3
                 OCCURS 1000 TIMES.
           01 INPUT-VALUE.
              02 IN-X   PICTURE S9(14)V9(4).
              02 FILLER PICTURE X(62).
           01 TITLE-LINE.
              02 FILLER PICTURE X(29) VALUE
                 '  MEAN AND STANDARD DEVIATION'.
           01 UNDER-LINE.
              02 FILLER PICTURE X(30) VALUE
                 '------------------------------'.
           01 COL-HEADS.
              02 FILLER PICTURE X(21) VALUE '          DATA VALUES'.
           01 DATA-LINE.
              02 FILLER PICTURE X(5) VALUES SPACES.
              02 OUT-X PICTURE -(14)9.9(4).
           01 PRINT-LINE-1.
              02 FILLER PICTURE X(9) VALUE ' MEAN=   '.
              02 OUT-MN PICTURE -(14)9.9(4).
           01 PRINT-LINE-2.
              02 FILLER PICTURE X(9) VALUE ' STDDEV= '.
              02 OUT-ST PICTURE -(14)9.9(4).
     
           PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE, OUTPUT OUTPUT-FILE.
           WRITE OUTPUT-LINE FROM TITLE-LINE AFTER ADVANCING 0 LINES.    
           WRITE OUTPUT-LINE FROM UNDER-LINE AFTER ADVANCING 1 LINES.    
           WRITE OUTPUT-LINE FROM COL-HEADS AFTER ADVANCING 1 LINES.    
           WRITE OUTPUT-LINE FROM UNDER-LINE AFTER ADVANCING 1 LINES.    
           MOVE ZERO TO SX.
           PERFORM INPUT-LOOP VARYING N FROM 1 BY 1
              UNTIL N IS GREATER THAN 1000.
     
           INPUT-LOOP.
           READ INPUT-FILE INTO INPUT-VALUE AT END GO TO B1.
           MOVE IN-X TO X(N), OUT-X.
           WRITE OUTPUT-LINE FROM DATA-LINE AFTER ADVANCING 1 LINE.
           ADD X(N) TO SX.
     
           B1.
           SUBTRACT 1 FROM N.
           DIVIDE N INTO SX GIVING M ROUNDED.
           PERFORM SUM-LOOP VARYING I FROM 1 BY 1 UNTIL I IS GREATER THAN N.
           COMPUTE STD ROUNDED = (SX / N) ** 0.5.
           WRITE OUTPUT-LINE FROM UNDER-LINE AFTER ADVANCING 1 LINE.
           MOVE M TO OUT-MN.
           MOVE STD TO OUT-ST.
           WRITE OUTPUT-LINE FROM PRINT-LINE-1 AFTER ADVANCING 1 LINE.
           WRITE OUTPUT-LINE FROM PRINT-LINE-2 AFTER ADVANCING 1 LINE.
           GO TO FINISH.
     
           SUM-LOOP.
           SUBTRACT M FROM X(I) GIVING TEMP.
           MULTIPLY TEMP BY TEMP GIVING TEMP.
           ADD TEMP TO SX.
     
           FINISH.
           CLOSE INPUT-FILE, OUTPUT-FILE.
     
           STOP RUN.
